Tekla Open API Reference for Tekla Structures 2025
Weld.WeldAttributes Constructor
 Creates a new default weld attributes instance that loads standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public WeldAttributes()
Public Sub New
See Also
Reference
Weld.WeldAttributes Class
Weld.WeldAttributes Overload
Tekla.Structures.Drawing Namespace